# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [21]:
# import libraries here
import pandas as pd
import numpy as np

# Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [22]:
# your code here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [23]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [24]:
# your code here
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [25]:
temp.describe()

       Temperature
count     7.000000
mean     15.158730
std       6.695265
min       3.333333
25%      11.944444
50%      17.222222
75%      19.722222
max      22.222222

"""
We have both categorical and numerical data meaning 2 categorical columns and one numerical column
"""

#### Select the rows where state is New York.

In [108]:
# your code here
ny_city = temp.loc[temp['State'] == 'New York']
ny_city

      City     State  Temperature  (City, State)
0      NYC  New York    19.444444      19.444444
1   Albany  New York     9.444444       9.444444
2  Buffalo  New York     3.333333       3.333333

#### What is the average temperature of cities in New York?

In [109]:
# your code here
temperature = temp['Temperature']
avg = sum(temperature)/len(temperature)
print("The average temperature of New TYork city is ", avg)

The average temperature of New TYork city is  15.15873015873016

#### Which states and cities have a temperature above 15 degrees Celsius?

In [129]:
# your code here
greater_15 = temp[temp.Temperature > 15] 
greater_15

       City        State  Temperature  (City, State)
0       NYC     New York    19.444444      19.444444
3  Hartford  Connecticut    17.222222      17.222222
5    Treton   New Jersey    22.222222      22.222222
6    Newark   New Jersey    20.000000      20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [111]:
# your code here

greater['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [161]:
# your code here
temp.loc[((temp['Temperature'] > 15) & (temp['Temperature'] < 20)), ['City','State']]

       City        State
0       NYC     New York
3  Hartford  Connecticut

#### Find the mean and standard deviation of the temperature of each state.

In [139]:
# your code here
# New York State
ny_city['Temperature'].mean()

10.74074074074074

In [141]:
# Connecticut State
con = temp.loc[temp['State'] == 'Connecticut']
con['Temperature'].mean()

15.833333333333332

In [144]:
# New Jersey state
new = temp.loc[temp['State'] == 'New Jersey']
np.mean(con['Temperature'])

15.833333333333332

In [145]:
# Standard deviation of New york state
ny_city['Temperature'].std()

8.133404168888054

In [147]:
# Standard deviation of Connecticut State
con['Temperature'].std()

1.9641855032959645

In [148]:
# Standard deviation of New Jersey
new['Temperature'].std()

1.5713484026367717

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [150]:
# your code here
employees = pd.read_csv('Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [153]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

"""
From the total six columns four of them are categorical and two of them are numerical
"""

#### What's the average salary in this company?

In [154]:
# your code here
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the highest salary?

In [157]:
# your code here
sal = employees['Salary']
avg = sum(sal)/len(sal)
print("The average salary is ", round(avg,2))

The average salary is  48.89

#### What's the lowest salary?

In [158]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [162]:
# your code here
employees.loc[(employees['Salary'] <=30), ['Name']]
#temp.loc[((temp['Temperature'] > 15) & (temp['Temperature'] < 20)), ['City','State']]

    Name
1  Maria
2  David

#### Find all the information about an employee called David.

In [163]:
# your code here
employees.loc[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [164]:
# your code here
employees.loc[employees['Name']=='David',['Salary']]

   Salary
2      30

#### Print all the rows where job title is associate.

In [165]:
# your code here
employees.loc[employees['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [167]:
# Method 1
# your code here
print(employees.iloc[:3])

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [168]:
# Method 2
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [170]:
# your code here
employees.loc[((employees['Title']== 'associate') & (employees['Salary'] >55)), ['Name']]

    Name
7  Pedro

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [183]:
# your code here
employees.groupby(by=['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [185]:
# your code here
title = employees.loc[employees['Title'] == 'associate',['Salary']].mean()
title

Salary    56.666667
dtype: float64

In [186]:
title = employees.loc[employees['Title'] == 'analyst',['Salary']].mean()
title

Salary    32.5
dtype: float64

####  Find the salary quartiles.

In [187]:
# your code here
# method 1
employees['Salary'].describe()

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

In [194]:
# method 2
employees.Salary.quantile([0.25,0.5,0.75])

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [195]:
# your code here
employees.groupby(by=['Gender']).mean()

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [198]:
# your code here
# column Years
employees['Years'].mean()
employees['Years'].min()
employees['Years'].max()

8

In [199]:
# column Salary
employees['Salary'].mean()
employees['Salary'].min()
employees['Salary'].max()

70

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [208]:
employees.agg({'Department' : ['min', 'max'], 'Salary' : ['min', 'max']})

    Department  Salary
min         HR      30
max      Sales      70

In [ ]:
# getting error
employees.apply(
    lambda row: calc_run_diff(row['Department'], row['Salary']),
    axis=1
)

# Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here